package ru.kudryashov.newtech.consts;

/**
 * Теги для свагера
 */
public interface SwaggerTag {
    /**
     * Работа с пользователями
     */
    String USER_TAG = "Контроллер для работы с пользователями";
    /**
     * Работа с заметками
     */
    String NOTE_TAG = "Контроллер для работы с заметками";
    /**
     * Работа с заявками
     */
    String REQUEST_TAG = "Контроллер для работы с заявками";
    /**
     * Работа с топиками
     */
    String TOPIC_TAG = "Контроллер для работы с топиками";
    /**
     * Работа с менеджерами
     */
    String MANAGER_TAG = "Контроллер для работы с менеджерами";
    /**
     * Работа с авторизацией
     */
    String AUTH_TAG = "Контроллер для работы с авторизацией";
}
